---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternallyTaggedGeometryObject
source: html/e6594c35-dc0d-d240-3bf3-1c5cb1589aa5.htm
---
# ExternallyTaggedGeometryObject Members

Releases all resources used by the ExternallyTaggedGeometryObject